In [5]:
import pandas as pd
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [9]:
pd.merge( employees, departments , on = "DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [13]:
pd.merge( employees, departments , on = "DeptID", how = "left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [17]:
pd.merge( employees, departments , on = "DeptID", how = "right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [21]:
pd.merge( employees, departments , on = "DeptID", how = "outer") #outer join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [31]:
df1 = pd.DataFrame({"Name":["Alice","Bob"],"Score":[223,333]})
df1

    Name  Score
0  Alice    223
1    Bob    333

In [33]:
df2 = pd.DataFrame({"Name":["Charlie", "David"],"Age":[23,34]})
df2

      Name  Age
0  Charlie   23
1    David   34

In [41]:

df1 = pd.DataFrame({"Name":["Alice","Bob"],"Score":[223,333]})
df2 = pd.DataFrame({"Name":["Charlie", "David"],"Age":[23,34]})
pd.concat([df1,df2])

      Name  Score   Age
0    Alice  223.0   NaN
1      Bob  333.0   NaN
0  Charlie    NaN  23.0
1    David    NaN  34.0

In [43]:
pd.concat([df1,df2])

      Name  Score   Age
0    Alice  223.0   NaN
1      Bob  333.0   NaN
0  Charlie    NaN  23.0
1    David    NaN  34.0

In [45]:
pd.concat([df1,df2], axis = 1) #axis = 1 krne se nye column bnke judd jate hai

    Name  Score     Name  Age
0  Alice    223  Charlie   23
1    Bob    333    David   34